#include <stdio.h>

int main() {
    float scores[3][3];                                    // [student][subject] : อาร์เรย์สำหรับเก็บคะแนนของนักเรียน 3 คนใน 3 วิชา
    float sum_subject[3] = {0, 0, 0};                       // อาร์เรย์สำหรับเก็บผลรวมคะแนนแต่ละวิชา
    float sum_student[3] = {0, 0, 0};                       // อาร์เรย์สำหรับเก็บคะแนนรวมของนักเรียนแต่ละคน
    char *subjects[] = {"Math", "Physics", "Chemistry"};   // อาร์เรย์ของสตริงสำหรับเก็บชื่อวิชา
    int i, j;                                               // สร้างตัวแปรสำหรับควบคุมการวนลูป
    // รับคะแนน
    for(i = 0; i < 3; i++) {                                // วนลูปตามจำนวนนักเรียน (i) ที่ i เริ่มจาก 0 และ +1 ไปจนกว่าจะ =3
        printf("Enter scores for Student %d:\n", i+1);      // แสดงข้อความเพื่อป้อนคะแนนของนักเรียนคนที่ i+1
        for(j = 0; j < 3; j++) {                            // วนลูปตามจำนวนวิชา (j) เริ่มจาก 0 และ +1 ไปจนกว่าจะ =3
            printf("%s: ", subjects[j]);                    // แสดงชื่อวิชา
            scanf("%f", &scores[i][j]);                     // อ่านค่าคะแนนที่ผู้ใช้ป้อนและเก็บลงในอาร์เรย์
            sum_student[i] += scores[i][j];                 // บวกคะแนนที่ป้อนเข้าไปในคะแนนรวมของนักเรียนคนปัจจุบัน
            sum_subject[j] += scores[i][j];                 // บวกคะแนนที่ป้อนเข้าไปในคะแนนรวมของวิชาปัจจุบัน
        }
    }
    // แสดงตารางคะแนน
    printf("\nScore Table:\n");
    printf("Student   Math   Physics  Chemistry\n");
    for(i = 0; i < 3; i++) {                                // วนลูปตามจำนวนนักเรียน (i)เริ่มจาก 0 และ +1 ไปจนกว่าจะ =3
        printf("%d      ", i+1);                             // แสดงหมายเลขนักเรียน
        for(j = 0; j < 3; j++) {                            // วนลูปตามจำนวนวิชา (j)เริ่มจาก 0 และ +1 ไปจนกว่าจะ =3
            printf("  %6.2f", scores[i][j]);                 // แสดงคะแนนของนักเรียนแต่ละวิชา ที่รับค่ามา
        }
        printf("\n");                                          // ขึ้นบรรทัดใหม่เมื่อจบข้อมูลของนักเรียนแต่ละคน
    }
    // แสดงคะแนนรวมแต่ละคน
    printf("\n");
    for(i = 0; i < 3; i++) {                                                // วนลูปตามจำนวนนักเรียน (i)
        printf("Total score for Student %d = %.2f\n", i+1, sum_student[i]); // แสดงคะแนนรวมของนักเรียน
    }

    // แสดงค่าเฉลี่ยแต่ละวิชา
    printf("\nAverage per subject:\n");
    for(j = 0; j < 3; j++) {                                    // วนลูปตามจำนวนวิชา (j)เริ่มจาก 0 และ +1 ไปจนกว่าจะ =3
        printf("%s: %.2f\n", subjects[j], sum_subject[j]/3.0); // คำนวณและแสดงค่าเฉลี่ยของแต่ละวิชา
    }
    return 0; 
}